1.โหลด csv เข้าไปใน Python Pandas

In [2]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv')

print(df)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

2.เขียนโค้ดแสดง หัว10แถว ท้าย10แถว และสุ่ม10แถว

In [4]:
print(df.head(10))
print(df.tail(10))
print(df.sample(10))

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]
     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[10 rows x 12 columns]
     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
861          862         0       2  ...   11.5000   NaN         S
395          396         0       3  ...    7.7958   NaN         S
69            70         0       3  ...    8.6625   NaN         S
213          214         0       2  ...   13.0000   NaN         S
286          287         1       3  ...    9.5000   NaN         S
53            54         1       2  ...   26.0000   NaN         S
380          381         1       1  ...  227.5250   NaN         C
35            36         0       1  ...   52.0000   NaN         S
314          315         0       2  ...   26.2500   NaN         S
30            31         0       1  ...   27.7208   NaN         C

[10 rows x 12 columns]

3.ลบ row ที่มี Embarked ว่าง

In [14]:
# print(df)
#891 Rows
print(df[df['Embarked'] > ''].shape)

(889, 12)

4.เติม age ด้วยค่าเฉลี่ย

In [21]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
# print(df['Age'])
avg = df['Age'].mean()
print(avg)
df['Age'].fillna(value=avg)

29.69911764705882

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

5.เติม age ด้วย 0

In [22]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
df['Age'].fillna(value=0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

6.ลบ row ที่ age เป็นค่าว่าง

In [29]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df[df['Age'].notna()]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[714 rows x 12 columns]

7.หาจำนวนผู้หญิงต่อผู้ชายที่อยู่บนเรือ

In [30]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

8.หาจำนวนผู้หญิงและผู้ชายที่รอดชีวิต

In [46]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df2 = df[df['Survived']==1]
df2['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

9.หา % การรอดชีวิตของผู้หญิงและผู้ชาย

In [167]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df1 = df[df['Survived']==1]
totalSurvived = df1['Sex'].count()
df1 = df1['Sex'].value_counts().rename_axis('Sex').to_frame('counts')
df1['%'] = 100 * df1['counts'] / totalSurvived
print(df1)

        counts          %
Sex
female     233  68.128655
male       109  31.871345

10.แปลงคอลัมน์ female = 0 และ male = 1

11.หาคนที่อายุมากที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน

In [71]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
maxAge = df['Age'].max()
df2 = df[df['Age']==maxAge]
df2[['Name','Age','Embarked']]

                                     Name   Age Embarked
630  Barkworth, Mr. Algernon Henry Wilson  80.0        S

12.หาคนที่อายุน้อยที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน

In [73]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
minAge = df['Age'].min()
df2 = df[df['Age']==minAge]
df2[['Name','Age','Embarked']]

                                Name   Age Embarked
803  Thomas, Master. Assad Alexander  0.42        C

13.หาคนที่จ่ายค่าโดยสารแพงที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิตไหม

In [75]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
maxFare = df['Fare'].max()
df2 = df[df['Fare']==maxFare]
df2[['Name','Fare','Survived']]

                                   Name      Fare  Survived
258                    Ward, Miss. Anna  512.3292         1
679  Cardeza, Mr. Thomas Drake Martinez  512.3292         1
737              Lesurer, Mr. Gustave J  512.3292         1

14.หาคนที่จ่ายค่าโดยสารถูกที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิตไหม

In [76]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
minFare = df['Fare'].min()
df2 = df[df['Fare']==minFare]
df2[['Name','Fare','Survived']]

                                 Name  Fare  Survived
179               Leonard, Mr. Lionel   0.0         0
263             Harrison, Mr. William   0.0         0
271      Tornquist, Mr. William Henry   0.0         1
277       Parkes, Mr. Francis "Frank"   0.0         0
302   Johnson, Mr. William Cahoone Jr   0.0         0
413    Cunningham, Mr. Alfred Fleming   0.0         0
466             Campbell, Mr. William   0.0         0
481  Frost, Mr. Anthony Wood "Archie"   0.0         0
597               Johnson, Mr. Alfred   0.0         0
633     Parr, Mr. William Henry Marsh   0.0         0
674        Watson, Mr. Ennis Hastings   0.0         0
732              Knight, Mr. Robert J   0.0         0
806            Andrews, Mr. Thomas Jr   0.0         0
815                  Fry, Mr. Richard   0.0         0
822   Reuchlin, Jonkheer. John George   0.0         0

15.สรุปว่ามีคนนั่งตั๋ว 1 2 3 กี่คน

In [99]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

16.หาค่าเฉลี่ยของตั๋วโดยสารแบบที่นั่งชั้น 1 2 3

In [111]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
df = df[['Pclass','Fare']]
df.groupby('Pclass').mean()

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

17.มีผู้โดยสารกี่คนที่อายุเกิน 50 แล้วรอดชีวิต

In [185]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

df1 = df[(df['Age']>50) & (df['Survived']==1)]

print(df1['Age'].count())

22

18.แสดงผลข้อมูลทั้งหมดของที่นั่งชั้น 1 2 3 (describe)

19.แสดงผลตั๋วที่แพงที่สุดของที่นั่งแต่ละชั้น

In [186]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
df = df[['Pclass','Fare']]
df.groupby('Pclass').max()

            Fare
Pclass
1       512.3292
2        73.5000
3        69.5500

20.แสดงเป็นกลุ่มช่วงอายุ 0-10, 20-30 …. (เพิ่มทีละ10) และหาว่าแต่ละกลุ่มมีอัตราการรอดชีวิตเท่าไหร่

In [310]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

avg = df['Age'].mean()
df['Age'].fillna(value=avg, inplace=True)

totalRows = df['Age'].count()

df['Age_GRP'] = df['Age'] // 10

grouped_single = df.groupby('Age_GRP').agg({'Survived': ['size', 'sum']})

# rename columns
grouped_single.columns = ['TotalPerson', 'Survived']

# reset index to get grouped columns back
grouped_single = grouped_single.reset_index()

grouped_single['%'] = 100 * grouped_single['Survived'] / grouped_single['TotalPerson']
print (grouped_single)

   Age_GRP  TotalPerson  Survived           %
0      0.0           62        38   61.290323
1      1.0          102        41   40.196078
2      2.0          397       129   32.493703
3      3.0          167        73   43.712575
4      4.0           89        34   38.202247
5      5.0           48        20   41.666667
6      6.0           19         6   31.578947
7      7.0            6         0    0.000000
8      8.0            1         1  100.000000

21.เรียงลำดับตามราคามากไปน้อย และน้อยไปมาก

In [188]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})
print(df.sort_values('Fare'))

print(df.sort_values('Fare')[::-1])

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
271          272         1       3  ...    0.0000          NaN         S
597          598         0       3  ...    0.0000          NaN         S
302          303         0       3  ...    0.0000          NaN         S
633          634         0       1  ...    0.0000          NaN         S
277          278         0       2  ...    0.0000          NaN         S
..           ...       ...     ...  ...       ...          ...       ...
438          439         0       1  ...  263.0000  C23 C25 C27         S
341          342         1       1  ...  263.0000  C23 C25 C27         S
737          738         1       1  ...  512.3292         B101         C
258          259         1       1  ...  512.3292          NaN         C
679          680         1       1  ...  512.3292  B51 B53 B55         C

[891 rows x 12 columns]
     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
679          680         1       1  ...  512.3292  B51 B53 B55         C
258          259         1       1  ...  512.3292          NaN         C
737          738         1       1  ...  512.3292         B101         C
341          342         1       1  ...  263.0000  C23 C25 C27         S
438          439         0       1  ...  263.0000  C23 C25 C27         S
..           ...       ...     ...  ...       ...          ...       ...
277          278         0       2  ...    0.0000          NaN         S
633          634         0       1  ...    0.0000          NaN         S
302          303         0       3  ...    0.0000          NaN         S
597          598         0       3  ...    0.0000          NaN         S
271          272         1       3  ...    0.0000          NaN         S

[891 rows x 12 columns]

22.(Optional) หานามสกุลที่ซ้ำกัน และแต่ละนามสกุลที่ซ้ำกันซ้ำกันกี่คน

In [31]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

# สร้าง Column ใหม่ ตัดเอาแค่ Lastname คำที่อยู่ก่อน ,
df['lastname'] = df.apply(lambda x: x['Name'][0:x['Name'].find(',')] , axis=1) 
# สร้าง Column ใหม่ Check ว่า มี comma มากกว่า 1 ตัว หรือไม่
df['chk_comma'] = df.apply(lambda x: x['Name'].count(','), axis=1)

# group by
grouped_single = df.groupby('lastname').agg({'lastname': ['size', 'count']})

# rename columns
grouped_single.columns = ['TotalPerson', 'TotalCount']

# reset index to get grouped columns back
grouped_single = grouped_single.reset_index()

grouped_single = grouped_single[grouped_single['TotalCount']>1]

for ind in grouped_single.index: 
     print(grouped_single['lastname'][ind], grouped_single['TotalCount'][ind])

Abbott 2
Abelson 2
Ali 2
Allen 2
Allison 3
Andersson 9
Andrews 2
Arnold-Franchi 2
Asplund 4
Attalah 2
Backstrom 2
Baclini 4
Barbara 2
Baxter 2
Beane 2
Becker 2
Beckwith 2
Bishop 2
Boulos 3
Bourke 3
Braund 2
Brown 4
Cacic 2
Caldwell 2
Calic 2
Carlsson 2
Carter 6
Chambers 2
Chapman 2
Coleff 2
Collyer 3
Coutts 2
Crosby 2
Daly 2
Danbom 2
Davies 3
Dean 2
Dick 2
Doling 2
Duff Gordon 2
Elias 3
Flynn 3
Ford 4
Fortune 4
Frauenthal 2
Futrelle 2
Goldenberg 2
Goldsmith 3
Goodwin 6
Graham 3
Gustafsson 4
Hagland 2
Hakkarainen 2
Hamalainen 2
Hansen 3
Harper 4
Harris 4
Hart 4
Hays 2
Herman 2
Hickman 3
Hippach 2
Hocking 2
Holverson 2
Hoyt 3
Jacobsohn 2
Jensen 3
Johansson 3
Johnson 6
Johnston 2
Jussila 3
Kantor 2
Keane 2
Kelly 4
Lam 2
Laroche 3
Larsson 2
Lefebre 4
Lobb 2
Mallet 2
McCoy 2
Mellinger 2
Meyer 3
Minahan 2
Moor 2
Moran 3
Morley 2
Moubarek 2
Murphy 2
Nakid 2
Nasser 2
Navratil 3
Newell 3
Nicola-Yarred 2
O'Brien 3
Olsen 3
Olsson 2
Oreskovic 2
Palsson 4
Panula 6
Pears 2
Penasco y Castellana 2
Peter 2
Petroff 2
Quick 2
Renouf 2
Rice 5
Richards 3
Rosblom 2
Ryerson 2
Saad 2
Sage 7
Sandstrom 2
Silvey 2
Skoog 6
Smith 4
Stanley 2
Strom 2
Svensson 2
Taussig 3
Taylor 2
Thayer 3
Thorneycroft 2
Turpin 2
Van Impe 3
Vander Planke 3
Webber 2
West 3
White 2
Wick 2
Williams 4
Yasbeck 2
Zabour 2

23.(Optional) แสดงผลนามสกุลที่ไม่มีการซ้ำกันเลย และนับว่ามีกี่นามสกุล

In [30]:
df = pd.read_csv('https://raw.githubusercontent.com/hvisor/Homework_datacamp_2/master/train.csv',na_values={'Age':['']})

# สร้าง Column ใหม่ ตัดเอาแค่ Lastname คำที่อยู่ก่อน ,
df['lastname'] = df.apply(lambda x: x['Name'][0:x['Name'].find(',')] , axis=1) 
# สร้าง Column ใหม่ Check ว่า มี comma มากกว่า 1 ตัว หรือไม่
df['chk_comma'] = df.apply(lambda x: x['Name'].count(','), axis=1)

# group by
grouped_single = df.groupby('lastname').agg({'lastname': ['size', 'count']})

# rename columns
grouped_single.columns = ['TotalPerson', 'TotalCount']

# reset index to get grouped columns back
grouped_single = grouped_single.reset_index()

grouped_single = grouped_single[grouped_single['TotalCount']==1]

print(grouped_single['lastname'].count())
for ind in grouped_single.index: 
     print(grouped_single['lastname'][ind], grouped_single['TotalCount'][ind])

534
Abbing 1
Adahl 1
Adams 1
Ahlin 1
Aks 1
Albimona 1
Alexander 1
Alhomaki 1
Allum 1
Andersen-Jensen 1
Anderson 1
Andreasson 1
Andrew 1
Angle 1
Appleton 1
Artagaveytia 1
Asim 1
Astor 1
Aubart 1
Augustsson 1
Ayoub 1
Badt 1
Bailey 1
Balkic 1
Ball 1
Banfield 1
Barah 1
Barber 1
Barkworth 1
Barton 1
Bateman 1
Baumann 1
Bazzani 1
Beavan 1
Beesley 1
Behr 1
Bengtsson 1
Berglund 1
Berriman 1
Betros 1
Bidois 1
Bing 1
Birkeland 1
Bissette 1
Bjornstrom-Steffansson 1
Blackwell 1
Blank 1
Bonnell 1
Bostandyeff 1
Bowen 1
Bowerman 1
Bracken 1
Bradley 1
Brewe 1
Brocklebank 1
Bryhl 1
Burke 1
Burns 1
Buss 1
Butler 1
Butt 1
Byles 1
Bystrom 1
Cairns 1
Calderhead 1
Cameron 1
Campbell 1
Canavan 1
Cann 1
Caram 1
Carbines 1
Cardeza 1
Carr 1
Carrau 1
Cavendish 1
Celotti 1
Chaffee 1
Charters 1
Cherry 1
Chibnall 1
Chip 1
Christmann 1
Christy 1
Chronopoulos 1
Clarke 1
Cleaver 1
Clifford 1
Coelho 1
Cohen 1
Coleridge 1
Collander 1
Colley 1
Compton 1
Connaghton 1
Connolly 1
Connors 1
Cook 1
Cor 1
Corn 1
Coxon 1
Crease 1
Cribb 1
Culumovic 1
Cumings 1
Cunningham 1
Dahl 1
Dahlberg 1
Dakic 1
Daniel 1
Danoff 1
Dantcheff 1
Davidson 1
Davis 1
Davison 1
Denkoff 1
Dennis 1
Devaney 1
Dimic 1
Dodge 1
Doharr 1
Dooley 1
Dorking 1
Douglas 1
Dowdell 1
Downton 1
Drazenoic 1
Drew 1
Duane 1
Duran y More 1
Edvardsson 1
Eitemiller 1
Eklund 1
Ekstrom 1
Elsbury 1
Emanuel 1
Emir 1
Endres 1
Eustis 1
Fahlstrom 1
Farrell 1
Farthing 1
Faunthorpe 1
Fischer 1
Fleming 1
Foo 1
Foreman 1
Fox 1
Francatelli 1
Frolicher 1
Frolicher-Stehli 1
Frost 1
Fry 1
Funk 1
Fynney 1
Gale 1
Gallagher 1
Garfirth 1
Garside 1
Gaskell 1
Gavey 1
Gee 1
Gheorgheff 1
Giglio 1
Giles 1
Gilinski 1
Gill 1
Gillespie 1
Gilnagh 1
Givard 1
Glynn 1
Goldschmidt 1
Goncalves 1
Green 1
Greenberg 1
Greenfield 1
Gronnestad 1
Guggenheim 1
Haas 1
Hale 1
Hampe 1
Hanna 1
Harder 1
Harknett 1
Harmer 1
Harrington 1
Harrison 1
Hassab 1
Hassan 1
Hawksford 1
Healy 1
Hedman 1
Hegarty 1
Heikkinen 1
Heininen 1
Hendekovic 1
Henry 1
Hewlett 1
Hirvonen 1
Hodges 1
Hogeboom 1
Hold 1
Holm 1
Homer 1
Honkanen 1
Hood 1
Horgan 1
Hosono 1
Humblen 1
Hunt 1
Ibrahim Shawah 1
Icard 1
Ilett 1
Ilmakangas 1
Isham 1
Ivanoff 1
Jalsevac 1
Jansson 1
Jardin 1
Jarvis 1
Jenkin 1
Jermyn 1
Jerwan 1
Johannesen-Bratthammer 1
Johanson 1
Jonkoff 1
Jonsson 1
Kallio 1
Kalvik 1
Karaic 1
Karlsson 1
Karun 1
Kassem 1
Keefe 1
Kent 1
Kenyon 1
Kiernan 1
Kilgannon 1
Kimball 1
Kink 1
Kink-Heilmann 1
Kirkland 1
Klaber 1
Klasen 1
Knight 1
Kraeff 1
Kvillner 1
Lahoud 1
Lahtinen 1
Laitinen 1
Laleff 1
Landergren 1
Lang 1
LeRoy 1
Leader 1
Leeni 1
Lehmann 1
Leinonen 1
Leitch 1
Lemberopolous 1
Lemore 1
Lennon 1
Leonard 1
Lester 1
Lesurer 1
Levy 1
Lewy 1
Leyson 1
Lievens 1
Lindahl 1
Lindblom 1
Lindell 1
Lindqvist 1
Lines 1
Ling 1
Long 1
Longley 1
Louch 1
Lovell 1
Lulic 1
Lundahl 1
Lurette 1
Mack 1
Madigan 1
Madill 1
Madsen 1
Maenpaa 1
Maioni 1
Maisner 1
Mamee 1
Mangan 1
Mannion 1
Marechal 1
Markoff 1
Markun 1
Marvin 1
Masselmani 1
Matthews 1
Mayne 1
McCarthy 1
McCormack 1
McDermott 1
McEvoy 1
McGough 1
McGovern 1
McGowan 1
McKane 1
McMahon 1
McNamee 1
Meanwell 1
Meek 1
Mellors 1
Meo 1
Mernagh 1
Millet 1
Milling 1
Mineff 1
Mionoff 1
Mitchell 1
Mitkoff 1
Mockler 1
Moen 1
Molson 1
Montvila 1
Moore 1
Moraweck 1
Morrow 1
Moss 1
Moussa 1
Moutal 1
Mudd 1
Mullens 1
Murdlin 1
Myhrman 1
Naidenoff 1
Najib 1
Nankoff 1
Natsch 1
Nenkoff 1
Newsom 1
Nicholls 1
Nicholson 1
Nilsson 1
Nirva 1
Niskanen 1
Norman 1
Nosworthy 1
Novel 1
Nye 1
Nysten 1
Nysveen 1
O'Connell 1
O'Connor 1
O'Driscoll 1
O'Dwyer 1
O'Leary 1
O'Sullivan 1
Odahl 1
Ohman 1
Olsvigen 1
Osen 1
Osman 1
Ostby 1
Otter 1
Padro y Manent 1
Pain 1
Parkes 1
Parr 1
Parrish 1
Partner 1
Pasic 1
Patchett 1
Paulner 1
Pavlovic 1
Peduzzi 1
Pekoniemi 1
Pengelly 1
Perkin 1
Pernot 1
Perreault 1
Persson 1
Peters 1
Petranec 1
Petterson 1
Pettersson 1
Peuchen 1
Phillips 1
Pickard 1
Pinsky 1
Plotcharsky 1
Ponesell 1
Porter 1
Potter 1
Radeff 1
Razi 1
Reed 1
Reeves 1
Rekic 1
Reuchlin 1
Reynaldo 1
Richard 1
Ridsdale 1
Ringhini 1
Rintamaki 1
Risien 1
Robbins 1
Robert 1
Robins 1
Roebling 1
Rogers 1
Romaine 1
Rommetvedt 1
Rood 1
Ross 1
Rothes 1
Rothschild 1
Rouse 1
Rugg 1
Rush 1
Ryan 1
Saalfeld 1
Sadlier 1
Sagesser 1
Salkjelsvik 1
Salonen 1
Samaan 1
Saundercock 1
Sawyer 1
Scanlan 1
Sdycoff 1
Sedgwick 1
Serepeca 1
Seward 1
Sharp 1
Sheerlinck 1
Shellard 1
Shelley 1
Shorney 1
Shutes 1
Silven 1
Silverthorne 1
Simmons 1
Simonius-Blumer 1
Sinkkonen 1
Sirayanian 1
Sirota 1
Sivic 1
Sivola 1
Sjoblom 1
Sjostedt 1
Slabenoff 1
Slayter 1
Slemen 1
Slocovski 1
Sloper 1
Smart 1
Smiljanic 1
Sobey 1
Soholt 1
Somerton 1
Spedden 1
Spencer 1
Stahelin-Maeglin 1
Staneff 1
Stankovic 1
Stead 1
Stephenson 1
Stewart 1
Stone 1
Stoytcheff 1
Strandberg 1
Stranden 1
Sunderland 1
Sundman 1
Sutehall 1
Sutton 1
Swift 1
Theobald 1
Thomas 1
Thorne 1
Tikkanen 1
Tobin 1
Todoroff 1
Tomlin 1
Toomey 1
Torber 1
Tornquist 1
Toufik 1
Touma 1
Troupiansky 1
Trout 1
Troutt 1
Turcin 1
Turja 1
Turkula 1
Uruchurtu 1
Van der hoef 1
Vande Velde 1
Vande Walle 1
Vanden Steen 1
Vander Cruyssen 1
Vestrom 1
Vovk 1
Waelens 1
Walker 1
Ward 1
Warren 1
Watson 1
Watt 1
Weir 1
Weisz 1
Wells 1
Wheadon 1
Widegren 1
Widener 1
Wiklund 1
Wilhelms 1
Willey 1
Williams-Lambert 1
Windelov 1
Wiseman 1
Woolner 1
Wright 1
Young 1
Youseff 1
Yousif 1
Yousseff 1
Yrois 1
Zimmerman 1
de Messemaeker 1
de Mulder 1
de Pelsmaeker 1
del Carlo 1
van Billiard 1
van Melkebeke 1